Revit 2026 API

# RebarConstraintGetTargetRebarConstraintType Method

---

Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'. Rebar must be Shape Driven Rebar element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TargetRebarConstraintType GetTargetRebarConstraintType()
```
```vb
Public Function GetTargetRebarConstraintType As TargetRebarConstraintType
```
```cpp
public:
TargetRebarConstraintType GetTargetRebarConstraintType()
```
```fsharp
member GetTargetRebarConstraintType : unit -> TargetRebarConstraintType
```

#### Return Value

TargetRebarConstraintType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a shape driven rebar element. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace